X_WS_SOAP_Java/wsdl/wsgen/DocLiteralWrap/DocLiteralWrapServiceSEI.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. -->
<definitions targetNamespace="http://wrap.literal.doc.binding.ws.pg.com/" name="DocLiteralWrapServiceSEI" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://wrap.literal.doc.binding.ws.pg.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://wrap.literal.doc.binding.ws.pg.com/" schemaLocation="DocLiteralWrapServiceSEI_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="getExchangeRate">
    <part name="parameters" element="tns:getExchangeRate"/>
  </message>
  <message name="getExchangeRateResponse">
    <part name="parameters" element="tns:getExchangeRateResponse"/>
  </message>
  <portType name="DocLiteralWrapService">
    <operation name="getExchangeRate">
      <input message="tns:getExchangeRate"/>
      <output message="tns:getExchangeRateResponse"/>
    </operation>
  </portType>
  <binding name="DocLiteralWrapServiceImplPortBinding" type="tns:DocLiteralWrapService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="getExchangeRate">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="DocLiteralWrapServiceSEI">
    <port name="DocLiteralWrapServiceImplPort" binding="tns:DocLiteralWrapServiceImplPortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

